import t1

def analyze_user_activity(users: list): # TODO: ОТКУДА У ЮЗЕРОВ ДАННЫЕ О ИХ ТРЕНИРОВКАХ???
    pass
    # для каждого пользователя посчитает общее количество тренировок, общее количество
    # калорий, суммарное время тренировок (в часах) и выведет 3-х самых активных
    # пользователей в следующем виде:
    # ТОП-3 АКТИВНЫХ ПОЛЬЗОВАТЕЛЕЙ:
    #   1. Анна (продвинутый):
    #       Тренировок: 10
    #       Калорий: 4130
    #       Время: 9.0 часов
    #   2. Борис (средний):
    #       Тренировок: 9
    #       Калорий: 2750
    #       Время: 7.4 часов
    #   3. Григорий (продвинутый):
    #       Тренировок: 8
    #       Калорий: 4300
    #       Время: 8.8 часов

def analyze_workout_types(workouts):
    pass
    # выведет распределение по типам тренировок в следующем виде:
    # РАСПРЕДЕЛЕНИЕ ПО ТИПАМ ТРЕНИРОВОК:
    #   Бег: 13 тренировок (19.4%)
    #     Средняя длительность: 62 мин
    #     Средние калории: 575 ккал
    #   Силовая тренировка: 13 тренировок (19.4%)
    #     Средняя длительность: 56 мин
    #     Средние калории: 343 ккал
    #   Велосипед: 18 тренировок (26.9%)
    #     Средняя длительность: 53 мин
    #     Средние калории: 366 ккал
    #   Плавание: 5 тренировок (7.5%)
    #     Средняя длительность: 46 мин
    #     Средние калории: 368 ккал
    #   Ходьба: 18 тренировок (26.9%)
    #     Средняя длительность: 39 мин
    #     Средние калории: 196 ккал

def find_user_workouts(users, user_name): # TODO: ОТКУДА В ЮЗЕРАХ ДАННЫЕ О ТРЕНИРОВКАХ???
    pass
    # находит и возвращает все тренировки пользователя по имени

def analyze_user(user, workouts): # TODO: ОТКУДА В ВОРКАУТАХ ДАННЫЕ О ПОЛЬЗОВАТЕЛЕ???
    pass
    # выводит детальный анализ тренировок пользователя по имени в следующем виде:
    # ДЕТАЛЬНЫЙ АНАЛИЗ ДЛЯ ПОЛЬЗОВАТЕЛЯ: Борис
    # ===========================================
    # Возраст: 35 лет, Вес: 82 кг
    # Уровень: средний
    # Тренировок: 9
    # Сожжено калорий: 2750
    # Общее время: 7.4 часов
    # Пройдено дистанции: 64.3 км
    # Средние калории за тренировку: 306
    # Любимый тип тренировки: ходьба

if __name__ == "__main__":
    users = t1.load_users_data()
    workouts = t1.load_workouts_data()
    for user in users:
        for workout in workouts:
            if workout["user_id"] == user["user_id"]:
                user["workouts"].append(workout)
    analyze_user_activity(users)
